app/controllers/prototypes_controller.rb

SELECT `prototypes`.* FROM `prototypes`
---
  def index
    @prototypes = Prototype.all

INSERT INTO `prototypes` (`title`, `catch_copy`, `concept`, `user_id`, `created_at`, `updated_at`) VALUES ('あ', 'a', 'a', 5, '2021-07-04 06:29:53.338708', '2021-07-04 06:29:53.338708')
---
  def create
    @prototype = Prototype.new(prototype_params)
    if @prototype.save

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 3 LIMIT 1  [["id", 3], ["LIMIT", 1]]
SELECT `comments`.* FROM `comments` WHERE `comments`.`prototype_id` = 3
SELECT `users`.* FROM `users` WHERE `users`.`id` = 5 LIMIT 1
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 1 LIMIT 1
---
  def show
    @comment = Comment.new


    @prototype = Prototype.find(params[:id])
    @comments = @prototype.comments.includes(:user)

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 1 LIMIT 1
---
  def edit
    @prototype = Prototype.find(params[:id])

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 1 LIMIT 1
UPDATE `prototypes` SET `prototypes`.`title` = 'ぴ', `prototypes`.`catch_copy` = 'ぽ', `prototypes`.`concept` = 'ぷ', `prototypes`.`updated_at` = '2021-07-12 11:44:11.789986' WHERE `prototypes`.`id` = 1
---
  def update
    @prototype = Prototype.find(params[:id])
    if @prototype.update(prototype_params)

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 1 LIMIT 1
DELETE FROM `prototypes` WHERE `prototypes`.`id` = 1
---
    def destroy
      @prototype = Prototype.find(params[:id])
      if @prototype.destroy

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 3 LIMIT 1
---
    def set_prototype
      @prototype = Prototype.find(params[:id])